:PROPERTIES:
:title:    Nyxt
:END:

[[https://nyxt.atlas.engineer][Nyxt]] is a lisp based "Hacker's" browser, I'm gonna give it a go.

* Config
:PROPERTIES:
:header-args: :mkdirp yes :eval no :tangle ~/.config/nyxt/config.lisp
:END:

#+begin_src bash :eval no :export all :tangle no

  nyxt --no-socket --headless --quit --config ~/.config/nyxt/config.lisp

#+end_src

#+RESULTS:
| Nyxt   | version    | 3.12.0 |           |          |
| <INFO> | [09:28:09] | Source | location: | #P""     |
| <INFO> | [09:28:09] | Nyxt   | already   | started. |



#+begin_src emacs-lisp
(in-package #:nyxt-user)
#+end_src
